src/cf/InformationRegisters/вогМенеджерыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогМенеджерыОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьБрендМенеджерВТТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогВладелецМенеджеров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БрендМенеджер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогМенеджерыОбъектов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ЭтотОбъект.Отбор.Владелец.Значение) <> Тип("СправочникСсылка.вогТорговыеТочки") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
			УстановитьПривилегированныйРежим(Истина);
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	вогМенеджерыОбъектов.Менеджер КАК Менеджер
			|ИЗ
			|	РегистрСведений.вогМенеджерыОбъектов КАК вогМенеджерыОбъектов
			|ГДЕ
			|	вогМенеджерыОбъектов.Владелец = &Владелец
			|	И вогМенеджерыОбъектов.Подразделение = &Подразделение
			|	И вогМенеджерыОбъектов.Роль = &Роль
			|	И вогМенеджерыОбъектов.НаправлениеДеятельности = &НаправлениеДеятельности
			|	И вогМенеджерыОбъектов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
			|	И вогМенеджерыОбъектов.Менеджер <> &Менеджер
			|	И НЕ вогМенеджерыОбъектов.БрендМенеджер";
			
			Запрос.УстановитьПараметр("Владелец", 					Запись.Владелец);
			Запрос.УстановитьПараметр("НаправлениеДеятельности", 	Запись.НаправлениеДеятельности);
			Запрос.УстановитьПараметр("Подразделение", 				Запись.Подразделение);
			Запрос.УстановитьПараметр("Роль", 						Запись.Роль);
			Запрос.УстановитьПараметр("Менеджер", 					Запись.Менеджер);
			
			ВыборкаДанных = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаДанных.Следующий() Тогда
				
				ШаблонСообщения = НСтр("ru = 'У ""%1"" уже есть %2 %3 по направлению ""%4"".'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, Запись.Владелец, НРег(Запись.Роль),ВыборкаДанных.Менеджер ,Запись.НаправлениеДеятельности);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
				
			КонецЕсли;
			//Кайдашов DEV-133 +++
			Если НЕ Запись.БрендМенеджер и не Запись.ЕстьБрендМенеджерВТТ тогда
				Запрос.Текст =
				"ВЫБРАТЬ
				|	вогМенеджерыОбъектов.Менеджер КАК Менеджер
				|ИЗ
				|	РегистрСведений.вогМенеджерыОбъектов КАК вогМенеджерыОбъектов
				|ГДЕ
				|	вогМенеджерыОбъектов.Владелец = &Владелец
				|	И вогМенеджерыОбъектов.Роль = &Роль
				|	И вогМенеджерыОбъектов.НаправлениеДеятельности = &НаправлениеДеятельности
				|	И вогМенеджерыОбъектов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
				|	И вогМенеджерыОбъектов.Менеджер <> &Менеджер
				|	И вогМенеджерыОбъектов.БрендМенеджер";
				ВыборкаДанных = Запрос.Выполнить().Выбрать();
				Если ВыборкаДанных.Следующий() Тогда
					//Есть бренд-менеджер на этой ТТ
					Запись.ЕстьБрендМенеджерВТТ = Истина;
				Иначе
					Запись.ЕстьБрендМенеджерВТТ = Ложь;
				КонецЕсли;
			Иначе
				Запрос.Текст =
				"ВЫБРАТЬ
				|	вогМенеджерыОбъектов.Менеджер КАК Менеджер,
				|	вогМенеджерыОбъектов.Владелец КАК Владелец,
				|	вогМенеджерыОбъектов.Подразделение КАК Подразделение,
				|	вогМенеджерыОбъектов.Роль КАК Роль,
				|	вогМенеджерыОбъектов.НаправлениеДеятельности КАК НаправлениеДеятельности,
				|	вогМенеджерыОбъектов.БрендМенеджер КАК БрендМенеджер,
				|	вогМенеджерыОбъектов.ДатаНачала КАК ДатаНачала,
				|	вогМенеджерыОбъектов.ДатаОкончания КАК ДатаОкончания,
				|	вогМенеджерыОбъектов.ЕстьБрендМенеджерВТТ КАК ЕстьБрендМенеджерВТТ
				|ИЗ
				|	РегистрСведений.вогМенеджерыОбъектов КАК вогМенеджерыОбъектов
				|ГДЕ
				|	вогМенеджерыОбъектов.Владелец = &Владелец
				|	И вогМенеджерыОбъектов.Роль = &Роль
				|	И вогМенеджерыОбъектов.НаправлениеДеятельности = &НаправлениеДеятельности
				|	И вогМенеджерыОбъектов.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
				|	И вогМенеджерыОбъектов.Менеджер <> &Менеджер
				|	И НЕ вогМенеджерыОбъектов.БрендМенеджер";
				ВыборкаДанных = Запрос.Выполнить().Выбрать();
				Пока ВыборкаДанных.Следующий() цикл
					МЗ = РегистрыСведений.вогМенеджерыОбъектов.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МЗ,ВыборкаДанных);
					МЗ.ЕстьБрендМенеджерВТТ = Истина;
					МЗ.Записать(Истина);
				КонецЦикла;
			КонецЕсли;
			//Кайдашов DEV-133 ---
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

	
#КонецЕсли
